import json

import pandas as pd
import pytest


@pytest.fixture
def df_test_1():
    data = [
        ["24.04.2020", -2063, "RUB", "Супермаркеты", "Магнит"],
        ["19.03.2020", -2159, "RUB", "Супермаркеты", "Пятерочка"],
        ["06.04.2020", -2055, "RUB", "Супермаркеты", "Магнит"],
        ["14.05.2020", -507, "RUB", "Транспорт", "Такси"],
        ["21.03.2020", -607, "RUB", "Транспорт", "Такси"],
        ["07.02.2020", -3500, "RUB", "Перевод", "Иванов Д."],
        ["24.05.2020", -708, "RUB", "Переводы", "Лютикова Л."],
        ["13.03.2020", -1500, "RUB", "Наличные", "Снятие с банкомата"],
        ["06.05.2020", -2500, "RUB", "Наличные", "Снятие с банкомата"],
        ["11.04.2020", 1500, "RUB", "Бонусы", "КЭШбэк"],
        ["21.02.2020", 800, "RUB", "Бонусы", "КЭШбэк"],
    ]
    df = pd.DataFrame(data, columns=["Дата платежа", "Сумма операции", "Валюта операции", "Категория", "Описание"])
    return df


@pytest.fixture
def df_test_2():
    return (
        '{"Дата платежа":{"6":"2020-05-24T00:00:00.000"},"Сумма '
        'операции":{"6":-708},"Валюта '
        'операции":{"6":"RUB"},"Категория":{"6":"Переводы"},"Описание":{"6":"Лютикова '
        'Л."}}'
    )


@pytest.fixture
def sorted_category_expenses_test_1():
    return {
        "Супермаркеты": 6277,
        "Наличные": 4000,
        "Перевод": 3500,
        "Транспорт": 1114,
        "Переводы": 708,
        "Остальное": 0,
    }


@pytest.fixture
def currency_test_1():
    return {
        "success": True,
        "timestamp": 1768044067,
        "base": "RUB",
        "date": "2026-01-10",
        "rates": {"USD": 0.012613, "EUR": 0.010841},
    }


@pytest.fixture
def currency_test_2():
    return [{"currency": "USD", "rate": 79.28}, {"currency": "EUR", "rate": 92.24}]


@pytest.fixture
def currency_test_3():
    return {
        "error": {
            "code": "invalid_currency_codes",
            "message": "You have provided one or more invalid Currency Codes. [Required format: currencies=EUR,USD,GBP,...]",
        }
    }


@pytest.fixture
def stock_price_test_1():
    return [{"stock": "AAPL", "price": 259.37}]


@pytest.fixture
def reading_operations_xlsx_test_1():
    return {
        "Дата операции": {4762: "21.03.2019 17:01:37", 5869: "28.07.2018 01:29:19", 5877: "27.07.2018 12:53:58"},
        "Дата платежа": {4762: "21.03.2019", 5869: "28.07.2018", 5877: "27.07.2018"},
        "Номер карты": {4762: 0, 5869: "*4556", 5877: "*4556"},
        "Статус": {4762: "OK", 5869: "FAILED", 5877: "FAILED"},
        "Сумма операции": {4762: -190044.51, 5869: -179571.56, 5877: -179571.56},
        "Валюта операции": {4762: "RUB", 5869: "RUB", 5877: "RUB"},
        "Сумма платежа": {4762: -190044.51, 5869: -179571.56, 5877: -179571.56},
        "Валюта платежа": {4762: "RUB", 5869: "RUB", 5877: "RUB"},
        "Кэшбэк": {4762: 0.0, 5869: 0.0, 5877: 0.0},
        "Категория": {4762: "Переводы", 5869: 0, 5877: 0},
        "MCC": {4762: 0.0, 5869: 0.0, 5877: 0.0},
        "Описание": {
            4762: "Перевод Кредитная карта. ТП 10.2 RUR",
            5869: "Перевод средств с брокерского счета",
            5877: "Перевод средств с брокерского счета",
        },
        "Бонусы (включая кэшбэк)": {4762: 0, 5869: 0, 5877: 0},
        "Округление на инвесткопилку": {4762: 0, 5869: 0, 5877: 0},
        "Сумма операции с округлением": {4762: 190044.51, 5869: 179571.56, 5877: 179571.56},
    }


@pytest.fixture
def views_test_1():
    return {
        "expenses": {
            "total_amount": 67155,
            "main": [
                {"category": "Переводы", "amount": 47352},
                {"category": "ЖКХ", "amount": 7693},
                {"category": "Супермаркеты", "amount": 6418},
                {"category": "Книги", "amount": 1466},
                {"category": "Различные товары", "amount": 1339},
                {"category": "Аптеки", "amount": 1236},
                {"category": "Транспорт", "amount": 702},
                {"category": "Остальное", "amount": 948},
                {"category": "Наличные", "amount": 0},
            ],
            "transfers_and_cash": [
                {"category": "Наличные", "amount": 0.0},
                {"category": "Переводы", "amount": 47352.0},
            ],
        },
        "income": {
            "total_amount": 8037215,
            "main": [
                {"category": "Переводы", "amount": 45852},
                {"category": "Пополнения", "amount": 17043},
                {"category": "Бонусы", "amount": 113},
            ],
            "currency_rates": [{"currency": "EUR", "rate": 92.24}],
            "stock_prices": [{"stock": "GOOGL", "price": 328.57}],
        },
    }


@pytest.fixture
def masseg_test_1():
    return json.dumps(
        [
            {
                "Дата операции": "16.10.2021 15:16:16",
                "Дата платежа": "16.10.2021",
                "Номер карты": "",
                "Статус": "OK",
                "Сумма операции": -50.0,
                "Валюта операции": "RUB",
                "Сумма платежа": -50.0,
                "Валюта платежа": "RUB",
                "Кэшбэк": "",
                "Категория": "Переводы",
                "MCC": "",
                "Описание": "Азер Г.",
                "Бонусы (включая кэшбэк)": 0,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 50.0,
            }
        ],
        ensure_ascii=False,
    )
